Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་ཡང་གཞན་མ་ཡིན། བྱང་ཆུབ་སེམས་དཔའ་ཡང་གཞན་མ་ཡིན། སྔོན་གྱི་མཐའ་ཡང་གཞན་མ་ཡིན། ཕྱི་མའི་མཐའ་ཡང་གཞན་མ་ཡིན། དབུས་ཀྱང་གཞན་མ་ཡིན་ནོ།
en: That is to say, the nonexistence of all-aspect omniscience is not one distinct thing, and the emptiness, voidness, and lack of inherent existence in all-aspect omniscience is not one distinct thing, and bodhisattvas another, nor are the limit of the past, the limit of the future, and the intervening present distinct things.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན། ཐམས་ཅད་མཁྱེན་པ་མེད་པ་གང་ཡིན་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་གང་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དང་།
en: Venerable Śāradvatīputra, so it is that the nonexistence of all-aspect omniscience, the emptiness, voidness, and lack of inherent existence of all-aspect omniscience, and the bodhisattvas, the limit of the past, the limit of the future, and the intervening present, are all indeed not two things and are not to be divided into two.

source: སྔོན་གྱི་མཐའ་གང་ཡིན་པ་དང་། ཕྱི་མའི་མཐའ་གང་ཡིན་པ་དང་། དབུས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐའ་དང་། དབུས་སུ་མི་དམིགས་སོ།
en: Those, Venerable Śāradvatīputra, are the formulations explaining how bodhisattvas do not apprehend the limit of the past and bodhisattvas do not apprehend the limit of the future or the intervening present. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་ཡང་འདི་སྐད་དུ་ཅིའི་ཕྱིར་ན། གཟུགས་ཀུན་ཏུ་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་མཐའ་ཡས་པར་རིག་པར་བྱའོ། །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཀུན་ཏུ་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་མཐའ་ཡས་པར་རིག་པར་བྱ་ཞེས་ཟེར་བ་ནི།
en: Venerable Śāradvatīputra, you also asked why one should know that bodhisattvas are beyond all limits because physical forms are beyond all limits, and why one should know that bodhisattvas are beyond all limits because feelings, perceptions, formative predispositions, and consciousness are beyond all limits.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ནི་ནམ་མཁའ་དང་མཉམ།
en: Venerable Śāradvatīputra, physical forms are the same as space.

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ནི་ནམ་མཁའ་དང་མཉམ་པ་སྟེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ནམ་མཁའ་ལ་ནི་སྔོན་གྱི་མཐའ་མི་དམིགས། ཕྱི་མའི་མཐའ་དང་དབུས་མི་དམིགས་ཏེ། མཐའ་ཡས་ཀུན་ཏུ་མཐའ་ཡས་པའི་ཕྱིར། ནམ་མཁའ་ཞེས་མིང་དུ་བརྗོད་དོ།
en: Feelings, perceptions, formative predispositions, and consciousness are the same as space.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་གཟུགས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། གཟུགས་ཀྱི་སྔོན་གྱི་མཐའ་མི་དམིགས། ཕྱི་མའི་མཐའ་དང་དབུས་མི་དམིགས། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། རྣམ་པར་ཤེས་པའི་སྔོན་གྱི་མཐའ་མི་དམིགས།
en: If you ask why, {Dt.248} Venerable Śāradvatīputra, just as in space the limit of the past is not apprehended, and the limit of the future and the intervening present are not apprehended, but space is designated because it is boundless and beyond all limits, similarly, Venerable Śāradvatīputra, the past limit of physical forms is not apprehended and their future limit and intervening present are not apprehended because physical forms are emptiness; also the past limit of feelings, perceptions, formative predispositions, and consciousness is not apprehended, and the future limit and intervening [present] of consciousness [and so forth] are not apprehended, because consciousness [and so forth] are emptiness.

source: ཕྱི་མའི་མཐའ་དང་། དབུས་མི་དམིགས་ཏེ། སྟོང་པ་ཉིད་ལ་མཐའ་འམ། དབུས་མི་དམིགས་སོ།
en: In emptiness no limits or intervening present are apprehended.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། གཟུགས་ཀུན་ཏུ་མཐའ་ཡས། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཀུན་ཏུ་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་མཐའ་ཡས་པར་རིག་པར་བྱའོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སྐྱེ་མཆེད་རྣམས་དང་། ཁམས་རྣམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་།
en: That, Venerable Śāradvatīputra, is the formulation explaining how one should know that bodhisattvas are beyond all limits because physical forms are beyond all limits, and feelings, perceptions, formative predispositions, and consciousness are beyond all limits. “

source: གཟུངས་ཀྱི་སྒོ་དང་། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ནི་ནམ་མཁའ་དང་མཉམ་པ་སྟེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Venerable Śāradvatīputra, the sense fields, the sensory elements, the links of dependent origination, the perfections, all the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers [of the tathāgatas], the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas are all the same as space.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་དཔེར་ན། ནམ་མཁའ་ལ་ནི་སྔོན་གྱི་མཐའ་མི་དམིགས། ཕྱི་མའི་མཐའ་མི་དམིགས། དབུས་མི་དམིགས་ཏེ། མཐའ་ཡས་ཀུན་ཏུ་མཐའ་ཡས་པའི་ཕྱིར། ནམ་མཁའ་ཞེས་མིང་དུ་བརྗོད་དོ།
en: If you ask why, Venerable Śāradvatīputra, in the example of space the limit of the past is not apprehended, and the limit of the future and the intervening present are not apprehended—space is indicated because it is boundless and beyond all limits.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སྔོན་གྱི་མཐའ་མི་དམིགས། ཕྱི་མའི་མཐའ་མི་དམིགས། དབུས་མི་དམིགས་ཏེ།
en: Similarly, Venerable Śāradvatīputra, the past limit of the distinct qualities of the buddhas [and so forth] is not apprehended, and their future limit and intervening present are not apprehended, because the distinct qualities of the buddhas [and so forth] are emptiness; also the past limit of feelings, perceptions, formative predispositions, and consciousness is not apprehended, and the future limit and intervening present of consciousness [and so forth] are not apprehended, because consciousness [and so forth] are emptiness.

source: སྟོང་པ་ཉིད་ལ་མཐའ་འམ་དབུས་མི་དམིགས་སོ།
en: In emptiness no limits or intervening present are apprehended.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཀུན་ཏུ་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་མཐའ་ཡས་པར་རིག་པར་བྱའོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་ཡང་འདི་སྐད་དུ་ཅིའི་ཕྱིར་ན།
en: That, Venerable Śāradvatīputra, is the formulation explaining how one should know that bodhisattvas are beyond all limits because the distinct qualities of the buddhas [and so forth] are beyond all limits. “

source: གཟུགས་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དེ་ལྟ་བུ་ཡང་མེད་ཅིང་མི་དམིགས། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དེ་ལྟ་བུ་ཡང་མེད་ཅིང་མི་དམིགས་ཤེས་ཟེར་བ་ནི།
en: Venerable Śāradvatīputra, you also asked why physical forms are not discerned and cannot be apprehended as a bodhisattva, and why feelings, perceptions, formative predispositions, and consciousness are not discerned and cannot be apprehended as a bodhisattva.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ནི་གཟུགས་ཀྱིས་སྟོང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ནི་རྣམ་པར་ཤེས་པས་སྟོང་སྟེ།
en: Venerable Śāradvatīputra, physical forms are empty of physical forms, and feelings, perceptions, formative predispositions, and consciousness are empty of consciousness [and so forth].

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྟོང་པ་ཉིད་ལ་གཟུགས་མེད།
en: If you ask why, in emptiness there are no physical forms.

source: སྟོང་པ་ཉིད་ལ་བྱང་ཆུབ་སེམས་དཔའ་མེད།
en: In emptiness there are no bodhisattvas.

source: སྟོང་པ་ཉིད་ལ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མེད།
en: In emptiness there are no feelings, perceptions, formative predispositions, or consciousness. {

source: སྟོང་པ་ཉིད་ལ་བྱང་ཆུབ་སེམས་དཔའ་མེད་དོ།
en: Dt.249} In emptiness there are no bodhisattvas.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། གཟུགས་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དེ་ལྟ་བུ་ཡང་མེད་ཅིང་མི་དམིགས་སོ། །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དེ་ལྟ་བུ་ཡང་མེད་ཅིང་མི་དམིགས་སོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how physical forms are not discerned and cannot be apprehended as a bodhisattva; also, feelings, perceptions, formative predispositions, and consciousness are not discerned and cannot be apprehended as a bodhisattva. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པས་སྟོང་སྟེ།
en: Moreover, Venerable Śāradvatīputra, the perfection of generosity is empty of the perfection of generosity.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྟོང་པ་ཉིད་ལ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་མེད་དོ།
en: If you ask why, in emptiness there is no perfection of generosity, and there are no bodhisattvas.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་སྟོང་སྟེ།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are empty of the perfection of wisdom [and so forth].

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྟོང་པ་ཉིད་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་མེད་དོ།
en: If you ask why, in emptiness there is no perfection of wisdom [and so forth], and there are no bodhisattvas. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་ནང་སྟོང་པ་ཉིད་ནི་ནང་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་སྟེ།
en: Moreover, Venerable Śāradvatīputra, the emptiness of internal phenomena is empty of the emptiness of internal phenomena.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྟོང་པ་ཉིད་ལ་ནང་སྟོང་པ་ཉིད་མེད། བྱང་ཆུབ་སེམས་དཔའ་མེད་དོ།
en: If you ask why, in emptiness there is no emptiness of internal phenomena, and there are no bodhisattvas.

source: །ཕྱི་སྟོང་པ་ཉིད་དང་ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་སྟེ།
en: The emptiness of external phenomena, the emptiness of external and internal phenomena, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are empty of the emptiness of the essential nature of nonentities [and so forth].

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྟོང་པ་ཉིད་ལ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་མེད།
en: If you ask why, in emptiness there is no emptiness of the essential nature of nonentities [and so forth], and there are no bodhisattvas. “

source: བྱང་ཆུབ་སེམས་དཔའ་མེད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ནི། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱིས་སྟོང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: Moreover, Venerable Śāradvatīputra, the applications of mindfulness are empty of the applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི།
en: The correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are empty of the noble eightfold path [and so forth].

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པས་སྟོང་སྟེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྟོང་པ་ཉིད་ལ་དྲན་པ་ཉེ་བར་གཞག་པ་མེད། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མེད། བྱང་ཆུབ་སེམས་དཔའ་མེད་དོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་།
en: If you ask why, in emptiness there are no applications of mindfulness; there are no correct exertions, supports for miraculous ability, faculties, powers, branches of enlightenment, and noble eightfold path; and there are no bodhisattvas.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas are empty of the emptiness of the distinct qualities of the buddhas [and so forth].

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱིས་སྟོང་སྟེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྟོང་པ་ཉིད་ལ་འཕགས་པའི་བདེན་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་དུ་མེད། བྱང་ཆུབ་སེམས་དཔའ་མེད་དོ།
en: If you ask why, in emptiness there are no truths of the noble ones [and so forth], there are no [fruitional attributes], up to and including the distinct qualities of the buddhas, and there are no bodhisattvas. “

source: །ཆོས་ཀྱི་དབྱིངས་ནི་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་སྟོང་།
en: The realm of phenomena is empty of the realm of phenomena.

source: དེ་བཞིན་ཉིད་ནི་དེ་བཞིན་ཉིད་ཀྱིས་སྟོང་།
en: The real nature is empty of the real nature.

source: ཡང་དག་པའི་མཐའ་ནི་ཡང་དག་པའི་མཐས་སྟོང་།
en: The very limit of reality is empty of the very limit of reality.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ནི་བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ཀྱིས་སྟོང་།
en: The inconceivable realm is empty of the inconceivable realm.

source: ཐམས་ཅད་ཤེས་པ་ཉིད་ནི་ཐམས་ཅད་ཤེས་པ་ཉིད་ཀྱིས་སྟོང་།
en: Knowledge of all the dharmas is empty of knowledge of all the dharmas.

source: ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ནི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱིས་སྟོང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱིས་སྟོང་སྟེ།
en: Knowledge of the path is empty of knowledge of the path. All-aspect omniscience is empty of all-aspect omniscience.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྟོང་པ་ཉིད་ལ་ཆོས་ཀྱི་དབྱིངས་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མེད། བྱང་ཆུབ་སེམས་དཔའ་མེད་དོ།
en: If you ask why, in emptiness there is no realm of phenomena, there are no [other unconditioned phenomena], up to and including the inconceivable realm, and there are no bodhisattvas. “

source: །ཉན་ཐོས་ཀྱི་ཐེག་པ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པས་སྟོང་།
en: The vehicle of the śrāvakas is empty of the vehicle of the śrāvakas.

source: རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་སྟོང་།
en: The vehicle of the pratyekabuddhas is empty of the vehicle of the pratyekabuddhas.

source: སངས་རྒྱས་ཀྱི་ཐེག་པ་ནི་སངས་རྒྱས་ཀྱི་ཐེག་པས་སྟོང་།
en: The vehicle of the buddhas is empty of the vehicle of the buddhas.

source: ཉན་ཐོས་ནི་ཉན་ཐོས་ཀྱིས་སྟོང་།
en: The śrāvakas are empty of the śrāvakas.

source: རང་སངས་རྒྱས་ནི་རང་སངས་རྒྱས་ཀྱིས་སྟོང་།
en: The pratyekabuddhas are empty of the pratyekabuddhas.

source: དེ་བཞིན་གཤེགས་པ་ནི་དེ་བཞིན་གཤེགས་པས་སྟོང་སྟེ།
en: The tathāgatas are empty of the tathāgatas.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྟོང་པ་ཉིད་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་མེད། སངས་རྒྱས་ཀྱི་ཐེག་པའི་བར་དུ་མེད། ཉན་ཐོས་མེད། དེ་བཞིན་གཤེགས་པའི་བར་དུ་མེད།
en: If you ask why, in emptiness there is no vehicle of the śrāvakas, there are no [other vehicles], up to and including the vehicle of the buddhas, there are no śrāvakas, there are no [other realized beings], up to and including the tathāgatas, and there are no bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་མེད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། གཟུགས་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དེ་ལྟ་བུ་ཡང་མེད་ཅིང་མི་དམིགས་སོ། །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དེ་ལྟ་བུ་ཡང་མེད་ཅིང་མི་དམིགས་སོ།
en: Those, Venerable Śāradvatīputra, are the formulations explaining how physical forms are indeed not discerned and cannot be apprehended as a bodhisattva; feelings, perceptions, formative predispositions, and consciousness are not discerned and cannot be apprehended as a bodhisattva. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་ཡང་འདི་སྐད་དུ་བདག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དུ་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་མི་དམིགས་ན། བྱང་ཆུབ་སེམས་དཔའ་ནི་གང་ཞིག །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གང་ཞིག་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བྱ་ཞེས་ཟེར་བ།
en: Venerable Śāradvatīputra, you also asked, ‘Since in all respects, and in each and every way, I do not apprehend any bodhisattvas, then to which bodhisattvas should I give teaching and instruction in the perfection of wisdom?’

source: ཅིའི་ཕྱིར་དེ་སྐད་དུ་སྨྲ་ཞེས་ཟེར་བ་ནི། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ནི་གཟུགས་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: The reason for this remark, Venerable Śāradvatīputra, is that physical forms do not exist and cannot be apprehended in physical forms.

source: །གཟུགས་ནི་ཚོར་བ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Physical forms do not exist and cannot be apprehended in feelings.

source: །ཚོར་བ་ནི་ཚོར་བ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Feelings do not exist and cannot be apprehended in feelings.

source: །ཚོར་བ་ནི་གཟུགས་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Feelings do not exist and cannot be apprehended in physical forms.

source: །གཟུགས་དང་། ཚོར་བ་ནི་འདུ་ཤེས་ལ་མེད་ཅིང་། མི་དམིགས་སོ།
en: Physical forms and feelings do not exist and cannot be apprehended in perceptions.

source: །འདུ་ཤེས་ནི་འདུ་ཤེས་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Perceptions do not exist and cannot be apprehend in perceptions.

source: །འདུ་ཤེས་ནི་གཟུགས་དང་། ཚོར་བ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Perceptions do not exist and cannot be apprehended in physical forms or feelings.

source: །གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་ནི་འདུ་བྱེད་རྣམས་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Physical forms, feelings, and perceptions do not exist and cannot be apprehended in formative predispositions.

source: །འདུ་བྱེད་རྣམས་ནི་འདུ་བྱེད་རྣམས་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Formative predispositions do not exist and cannot be apprehended in formative predispositions.

source: །འདུ་བྱེད་རྣམས་ནི་གཟུགས་དང་ཚོར་བ་དང་འདུ་ཤེས་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Formative predispositions do not exist and cannot be apprehended in physical forms, feelings, or perceptions.

source: །གཟུགས་དང་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་རྣམས་ནི་རྣམ་པར་ཤེས་པ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Physical forms, feelings, perceptions, and formative predispositions do not exist and cannot be apprehended in consciousness. {

source: །རྣམ་པར་ཤེས་པ་ནི་རྣམ་པར་ཤེས་པ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Dt.250} Consciousness does not exist and cannot be apprehended in consciousness.

source: །རྣམ་པར་ཤེས་པ་ནི་གཟུགས་དང་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་རྣམས་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Consciousness do not exist and cannot be apprehended in physical forms, feelings, perceptions, or formative predispositions. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མིག་ནི་མིག་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, the eyes do not exist and cannot be apprehended in the eyes.

source: །མིག་ནི་རྣ་བ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: The eyes do not exist and cannot be apprehended in the ears.

source: །རྣ་བ་ནི་རྣ་བ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: The ears do not exist and cannot be apprehended in the ears.

source: །རྣ་བ་ནི་མིག་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: The ears do not exist and cannot be apprehended in the eyes.

source: །མིག་དང་རྣ་བ་ནི་སྣ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: The eyes and the ears do not exist and cannot be apprehended in the nose.

source: །སྣ་ནི་སྣ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: The nose does not exist and cannot be apprehended in the nose.

source: །སྣ་ནི་མིག་དང་རྣ་བ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: The nose does not exist and cannot be apprehended in the eyes or ears.

source: །མིག་དང་རྣ་བ་དང་སྣ་ནི་ལྕེ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: The eyes and ears do not exist and cannot be apprehended in the tongue.

source: །ལྕེ་ནི་ལྕེ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: The tongue does not exist and cannot be apprehended in the tongue.

source: །ལྕེ་ནི་མིག་དང་རྣ་བ་དང་། སྣ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: The tongue does not exist and cannot be apprehended in the eyes, ears, or nose.

source: །མིག་དང་རྣ་བ་དང་སྣ་དང་ལྕེ་ནི་ལུས་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: The eyes, ears, nose, and tongue do not exist and cannot be apprehended in the body.

source: །ལུས་ནི་ལུས་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: The body does not exist and cannot be apprehended in the body.

source: །ལུས་ནི་མིག་དང་རྣ་བ་དང་སྣ་དང་ལྕེ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: The body does not exist and cannot be apprehended in the ears, ears, nose, or tongue.

source: །མིག་དང་རྣ་བ་དང་སྣ་དང་། ལྕེ་དང་ལུས་ནི་ཡིད་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: The eyes, ears, nose, tongue, and body do not exist and cannot be apprehended in the mental faculty.

source: །ཡིད་ནི་ཡིད་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: The mental faculty does not exist and cannot be apprehended in the mental faculty.

source: །ཡིད་ནི་མིག་དང་རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་ལ་མེད་ཅིང་མི་དམིགས་སོ། །གཟུགས་ནི་གཟུགས་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: The mental faculty does not exist and cannot be apprehended in the eyes, ears, nose, tongue, or body. “Sights do not exist and cannot be apprehended in sights.

source: །གཟུགས་ནི་སྒྲ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Sights do not exist and cannot be apprehended in sounds.

source: །སྒྲ་ནི་སྒྲ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Sounds do not exist and cannot be apprehended in sounds.

source: །སྒྲ་ནི་གཟུགས་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Sounds do not exist and cannot be apprehended in sights.

source: །གཟུགས་དང་སྒྲ་ནི་དྲི་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Sights and sounds do not exist and cannot be apprehended in odors.

source: །དྲི་ནི་དྲི་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Odors do not exist and cannot be apprehended in odors.

source: །དྲི་ནི་གཟུགས་དང་སྒྲ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Odors do not exist and cannot be apprehended in sights or sounds.

source: གཟུགས་དང་སྒྲ་དང་དྲི་ནི་རོ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Sights, sounds, and odors do not exist and cannot be apprehended in tastes.

source: །རོ་ནི་རོ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Tastes do not exist and cannot be apprehended in tastes.

source: །རོ་ནི་གཟུགས་དང་སྒྲ་དང་དྲི་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Tastes do not exist and cannot be apprehended in sights, sounds, or odors.

source: །གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་ནི་རེག་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Sights, sounds, odors, and tastes do not exist and cannot be apprehended in tangibles.

source: །རེག་ནི་རེག་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Tangibles do not exist and cannot be apprehended in tangibles.

source: །རེག་ནི་གཟུགས་དང་། སྒྲ་དང་དྲི་དང་རོ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Tangibles do not exist and cannot be apprehended in sights, sounds, odors, or tastes.

source: །གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་ནི་ཆོས་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Sights, sounds, odors, tastes, and tangibles do not exist and cannot be apprehended in mental phenomena.

source: །ཆོས་ནི་ཆོས་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Mental phenomena do not exist and cannot be apprehended in mental phenomena.

source: །ཆོས་ནི་གཟུགས་དང་། སྒྲ་དང་དྲི་དང་རོ་དང་རེག་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Mental phenomena do not exist and cannot be apprehended in sights, sounds, odors, tastes, or tangibles. “

source: །མིག་གི་རྣམ་པར་ཤེས་པ་ནི་མིག་གི་རྣམ་པར་ཤེས་པ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Visual consciousness does not exist and cannot be apprehended in visual consciousness.

source: །མིག་གི་རྣམ་པར་ཤེས་པ་ནི་རྣ་བའི་རྣམ་པར་ཤེས་པ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Visual consciousness does not exist and cannot be apprehended in auditory consciousness.

source: །རྣ་བའི་རྣམ་པར་ཤེས་པ་ནི་རྣ་བའི་རྣམ་པར་ཤེས་པ་ལ་མེད་ཅིང་མི་དམིགས་སོ།
en: Auditory consciousness does not exist and cannot be apprehended in auditory consciousness.
